       *> Inicia a identificação do programa COBOL.
       IDENTIFICATION DIVISION.
       *> Define o nome do programa executável.
       PROGRAM-ID. OLA-CAROLINA.

       *> Inicia a área de procedimentos, onde ficam as instruções de execução.
       PROCEDURE DIVISION.
           *> Exibe uma mensagem para o usuário na tela.
           DISPLAY "OLA CAROLINA!".
           DISPLAY "ESTOU APRENDENDO COBOL.".
           DISPLAY "MEU PRIMEIRO PROGRAMA.".
           *> Finaliza a execução do programa.
           STOP RUN.