      *>Inicia a identificação do programa COBOL.
       IDENTIFICATION DIVISION.
       *> Define o nome do programa executável.
       PROGRAM-ID. OLA-CAROLINA.

       *> Inicia a área de procedimentos, onde ficam as instruções de execução.
       PROCEDURE DIVISION.
           *> Exibe uma mensagem para o usuário na tela.

           DISPLAY "========================================.".
           DISPLAY "CADASTRO DE ESTAGIARIO".
           DISPLAY "========================================.".
           DISPLAY "NOME: CAROLINA!".
           DISPLAY "CARGO: ESTAGIARIO".
           DISPLAY "AREA: TECNOLOGIA".
           DISPLAY "lINGUAGEM: COBOL".

           DISPLAY        "========================================.".
           DISPLAY        "BEM-VINDO AO MUNDO COBOL!".
           DISPLAY        "========================================.".
           *> Finaliza a execução do programa.
           STOP RUN.