       IDENTIFICATION DIVISION. *> Define a identificação do programa.
       PROGRAM-ID. HELLO.         *> Nome do programa COBOL: HELLO.

       PROCEDURE DIVISION.        *> Inicia o bloco principal de execução.

           DISPLAY "OLA, MUNDO!".     *> Exibe a mensagem na tela.

           STOP RUN.                   *> Encerra a execução do programa.
